# Copilot

# 1.

In [5]:
import pandas as pd

C:\Users\My Pc\AppData\Local\Temp\ipykernel_8340\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# 2.

In [7]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

# 3.

In [10]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

# 4.

In [8]:
# Displaying the first 10 entries
print(chipo.head(10))

   order_id  quantity                              item_name  \
0         1         1           Chips and Fresh Tomato Salsa
1         1         1                                   Izze
2         1         1                       Nantucket Nectar
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl
5         3         1                           Chicken Bowl
6         3         1                          Side of Chips
7         4         1                          Steak Burrito
8         4         1                       Steak Soft Tacos
9         5         1                          Steak Burrito

                                  choice_description item_price
0                                                NaN     $2.39
1                                       [Clementine]     $3.39
2                                            [Apple]     $3.39
3                                                NaN     $2.39
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
5  [Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...    $10.98
6                                                NaN     $1.69
7  [Tomatillo Red Chili Salsa, [Fajita Vegetables...    $11.75
8  [Tomatillo Green Chili Salsa, [Pinto Beans, Ch...     $9.25
9  [Fresh Tomato Salsa, [Rice, Black Beans, Pinto...     $9.25

# 5.

In [ ]:


# Getting the number of observations (rows) in the dataset
num_observations = chipo.shape[0]

print(f'The number of observations in the dataset is: {num_observations}')

# 6.

In [11]:
# Getting the number of columns in the dataset
num_columns = chipo.shape[1]

print(f'The number of columns in the dataset is: {num_columns}')

The number of columns in the dataset is: 5

# 7.

In [12]:
# Printing the names of all the columns
column_names = chipo.columns

print('Column names:')
for column in column_names:
    print(column)

Column names:
order_id
quantity
item_name
choice_description
item_price

# 8.

In [13]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

# 9.

In [14]:
c = chipo.groupby('item_name')
c = c.sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(1)

,order_id,quantity,choice_description,item_price
item_name,,,,
Chicken Bowl,713926,761,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98 $10.98 $11.25 $8.75 $8.49 $11.25 $8.75 ...

# 10.

In [15]:
c = chipo.groupby('item_name')
c = c.sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(1)

,order_id,quantity,choice_description,item_price
item_name,,,,
Chicken Bowl,713926,761,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98 $10.98 $11.25 $8.75 $8.49 $11.25 $8.75 ...

# 11.

In [16]:
c= chipo.groupby('choice_description').sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(1)

,order_id,quantity,item_name,item_price
choice_description,,,,
[Diet Coke],123455,159,Canned SodaCanned SodaCanned Soda6 Pack Soft D...,$2.18 $1.09 $1.09 $6.49 $2.18 $1.25 $1.09 $6.4...

# 12.

In [17]:
total_items_orders = chipo.quantity.sum()
total_items_orders

4972

# 13.

In [18]:
chipo.item_price.dtype

dtype('O')

# 14.

In [23]:
revenue = (chipo['quantity']* chipo['item_price']).sum()

print('Revenue was: $' + str(np.round(revenue,2)))

NameError: name 'np' is not defined

# 15.

In [22]:
orders = chipo.order_id.value_counts().count()
orders

1834

# Occupation

# 1.

In [24]:
import pandas as pd

# 2.

# 3.

In [25]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

# 4.

In [26]:


users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

# 5.

In [28]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# 6.

In [29]:


users.shape[0]

943

# 7.

In [30]:
users.shape[1]

4

# 8.

In [31]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# 9.

In [32]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

# 10.

In [33]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# 11.

In [34]:
users.occupation

#or

users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# 12.

In [35]:
users.occupation.nunique()
#or by using value_counts() which returns the count of unique elements
#users.occupation.value_counts().count()

21

# 13.

In [36]:
#Because "most" is asked
users.occupation.value_counts().head(1).index[0]

#or
#to have the top 5

# users.occupation.value_counts().head()

'student'

# 14.

In [37]:
users.describe() #Notice: by default, only the numeric columns are returned.

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

# 15.

In [38]:
users.describe(include = "all") #Notice: By default, only the numeric columns are returned.

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

# 16.

In [39]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# 17.

In [40]:
round(users.age.mean())

34

# 18.

In [41]:
users.age.value_counts().tail() #7, 10, 11, 66 and 73 year

age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64

# World Food Facts.

# 1.

In [5]:
import pandas as pd

C:\Users\My Pc\AppData\Local\Temp\ipykernel_8632\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# 2.

# 3.

In [6]:
url = "https://www.kaggle.com/openfoodfacts/world-food-facts/data"
    
food = pd.read_csv(url, sep = '\t')

# 4.

In [19]:
print(food.head(5))

                                     <!DOCTYPE html>
0                                   <html lang="en">
1                                             <head>
2            <title>Open Food Facts | Kaggle</title>
3                           <meta charset="utf-8" />
4      <meta name="robots" content="index, follow...

# 5.

In [20]:
num_observations = food.shape[0]
print("Number of observations in the dataset:", num_observations)

Number of observations in the dataset: 143

# 6.

In [21]:
num_columns = food.shape[1]
print("Number of columns in the dataset:", num_columns)

Number of columns in the dataset: 1

# 7.

In [22]:
print("Column names:")
for column_name in food.columns:
    print(column_name)

Column names:
<!DOCTYPE html>

# 8.

In [11]:
food.columns[0]

'<!DOCTYPE html>'

# 9.

In [12]:
food.dtypes['-glucose_100g']

KeyError: '-glucose_100g'

# 10.

In [13]:
index_type = food.index
print("Index type of the dataset:", type(index_type))

Index type of the dataset: <class 'pandas.core.indexes.range.RangeIndex'>

# 11.

In [15]:
product_name_19th = food.iloc[18]['food']
print(product_name_19th)

KeyError: 'food'